Tekla.Structures.Geometry3d.Point
The Point class represents a single position in 3D space.

Tekla.Structures.Geometry3d.Point.X
The X-coordinate of the point.

Tekla.Structures.Geometry3d.Point.Y
The Y-coordinate of the point.

Tekla.Structures.Geometry3d.Point.Z
The Z-coordinate of the point.

Tekla.Structures.Geometry3d.Point.EPSILON_SQUARED
A boundary value for comparing if two points are similar.

Tekla.Structures.Geometry3d.Point.HASH_SEED
A default seed value for creating hash codes.

Tekla.Structures.Geometry3d.Point.#ctor
Instantiates a point with zero members.

Tekla.Structures.Geometry3d.Point.#ctor(System.Double,System.Double,System.Double)
Instantiates a point with the given coordinates.
X: The X-coordinate to be used.
Y: The Y-coordinate to be used.
Z: The Z-coordinate to be used.

Tekla.Structures.Geometry3d.Point.#ctor(System.Double,System.Double)
Instantiates a point with the given coordinates and zero Z-coordinate.
X: The X-coordinate to be used.
Y: The Y-coordinate to be used.

Tekla.Structures.Geometry3d.Point.#ctor(Tekla.Structures.Geometry3d.Point)
Instantiates a point with the given other point.
Point: The other point to be used.

Tekla.Structures.Geometry3d.Point.Zero
Zeros all the members of the point.

Tekla.Structures.Geometry3d.Point.ToString
Formats the point into a string.
Returns: The string that represents the point.

Tekla.Structures.Geometry3d.Point.Translate(System.Double,System.Double,System.Double)
Translates the point using the given vector.
X: The X-translation to be used.
Y: The Y-translation to be used.
Z: The Z-translation to be used.

Tekla.Structures.Geometry3d.Point.op_Addition(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Returns the sum of the given two points.
p1: The first point to be used.
p2: The second point to be used.
Returns: The sum of the given two points.

Tekla.Structures.Geometry3d.Point.op_Subtraction(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Returns the difference of the given two points.
p1: The first point to be used.
p2: The second point to be used.
Returns: The difference of the given two points.

Tekla.Structures.Geometry3d.Point.op_Equality(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Compares the given two points for similarity.
p1: The first point to be used.
p2: The second point to be used.
Returns: True if the given two points are similar. False otherwise.

Tekla.Structures.Geometry3d.Point.op_Inequality(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Compares if the two given points are not similar.
p1: The first point to be used.
p2: The second point to be used.
Returns: True if the given two points are not similar. False otherwise.

Tekla.Structures.Geometry3d.Point.Equals(System.Object)
Returns true if the current object and the given object are equal.
obj: The object we wish to check the equality with.
Returns: True if the given object equals the current object.

Tekla.Structures.Geometry3d.Point.GetHashCode
Returns a hash code for the point.
Notice, in extremely rare cases, you might not get the same
hash code for two points even though they are considered equal! This
should, however, happen only in extremely rare cases!
Returns: The hash code for the point.

Tekla.Structures.Geometry3d.Point.AreEqual(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Compares two points and tells whether they are equal.
Point1: The first point to be compared.
Point2: The second point to be compared.
Returns: True if the points are equal, false otherwise.

Tekla.Structures.Geometry3d.Point.CompareTo(System.Object)
Compares two points. To use binarysearch somekind of sorting should be used.
obj: The point to be compared.
Returns: 0 if both are equal, -1 if this point is before, 1 if this point is after.